In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
% matplotlib inline
#准备CCSS数据集
ccss = pd.read_excel("ccss_sample.xlsx")
ccss.head()

,time,id,s0,s2,s3,s4,s5,s7,s9,c0_1,...,Qs9,Qa3,Qa4,Qa8,Qa9,Qa10,Qa16,index1,index1a,index1b
0,200704,1,北京,男,20,本科,公司普通职员（白领）,未婚,2000-2999元,0,...,2500.0,100,200,200,200,100,100,109.349371,88.035919,121.071238
1,200704,2,北京,男,24,高中/中专,公司普通职员（白领）,未婚,6000-7999元,0,...,7000.0,100,100,100,150,200,100,93.728032,88.035919,96.856991
2,200704,3,上海,男,20,高中/中专,无业/待业/失业/家庭主妇,未婚,1000-1499元,0,...,1250.0,100,150,150,100,100,100,93.728032,88.035919,96.856991
3,200704,4,北京,女,65,大专,企/事业管理人员,已婚,1000-1499元,0,...,1250.0,150,150,100,100,100,200,109.349371,154.062858,84.749867
4,200704,5,上海,女,40,高中/中专,公司普通职员（白领）,已婚,99拒绝回答,0,...,NaN,100,100,100,100,150,100,85.917363,88.035919,84.749867

In [2]:
df = DataFrame(np.random.randint(0,3, size = (6,2)),
               columns = ['语文', '数学'],
               index = ['张三','李四','王五','李四','小吴','张三'])
df

    语文  数学
张三   1   0
李四   1   0
王五   1   1
李四   1   0
小吴   2   2
张三   0   0

In [3]:
df.duplicated()

张三    False
李四     True
王五    False
李四     True
小吴    False
张三    False
dtype: bool

In [4]:
df.drop_duplicates()

    语文  数学
张三   1   0
王五   1   1
小吴   2   2
张三   0   0

In [5]:
df2 = pd.concat([df,df],axis = 1)

In [6]:
#Buffer has wrong number of dimensions
#列重名
#df2.drop_duplicates()

In [8]:
def squart(item):
    return item**2

In [21]:
def adds(item):
    return 10

In [14]:
df = DataFrame(np.random.randint(0,100,size = (3,3)),
               columns = ['Python','Java','UI'],
               index = ['张三','李四','王五'])
df

    Python  Java  UI
张三      20    49  78
李四      36    86  76
王五      98    19  69

In [16]:
df['UI'] = None

    Python  Java    UI
张三      20    49  None
李四      36    86  None
王五      98    19  None

In [19]:
df['Python'] = df['Python'].map(squart)
df

    Python  Java    UI
张三     400    49  None
李四    1296    86  None
王五    9604    19  None

In [22]:
df['UI'] = df['UI'].map(adds)
df

    Python  Java  UI
张三     400    49  10
李四    1296    86  10
王五    9604    19  10

In [30]:
df['UI']['张三'] = np.nan
df

    Python  Java    UI
张三     400    49   NaN
李四    1296    86  10.0
王五    9604    19  10.0

In [36]:
def squart(item):
    if item > 0:
        return item**2
    else:
        return 0

In [32]:
df.fillna(0, inplace=True)

In [34]:
df2 = df.astype(int)

In [39]:
df2['UI'] = df['UI'].map(squart)
df2

张三    49
李四    86
王五    19
Name: Java, dtype: int32

In [41]:
#map()不仅可以根据条件修改当前列，map（）还可以映射新一列数据
#map()中我们可以使用lambda表达式，还可以使用方法，可以自己实现的方法
#map()中不能使用sum之类的函数，for循环
df2['HTML5'] = df2['Java'].map(lambda x : x+3)
df2

    Python  Java     UI  HTML5
张三     400    49    0.0     52
李四    1296    86  100.0     89
王五    9604    19  100.0     22

In [43]:
#transform该方法根据某种规则算法，进行批量修改
df2['Java'] = df2['Java'].transform(squart)
df2

    Python      Java     UI  HTML5
张三     400   5764801    0.0     52
李四    1296  54700816  100.0     89
王五    9604    130321  100.0     22

In [45]:
df = DataFrame(np.random.randint(0,150,size=(3,1)),
               index = ['张三','李四','Michael'],
              columns = ['Python'])
df

         Python
张三           73
李四           40
Michael     137

In [51]:
# 方法中参数，就是DataFrame中一列的每一个数据
def state(i):
    if i < 90:
        return 'failed'
    elif i > 120:
        return 'Excellent'
    else:
        return 'Pass'

In [52]:
df['State'] = df['Python'].map(state)
df

         Python      State
张三           73     failed
李四           40     failed
Michael     137  Excellent

In [55]:
index = {'张三': 'ZhangSir', '李四': 'LiSir'}
columns = {'State': '状态'}

In [56]:
df.rename(index = index, columns = columns)

          Python         状态
ZhangSir      73     failed
LiSir         40     failed
Michael      137  Excellent

In [57]:
df = DataFrame(np.random.randint(0,150, size = (6,3)),
               index = list('ABCDEF'), columns = list('语数外'))
df

     语    数    外
A   48   54  139
B   68   45   62
C  138   57  102
D  130  119   99
E   97  143  103
F   16  101   40

In [58]:
df.describe()

                语           数           外
count    6.000000    6.000000    6.000000
mean    82.833333   86.500000   90.833333
std     47.684029   40.267853   34.856372
min     16.000000   45.000000   40.000000
25%     53.000000   54.750000   71.250000
50%     82.500000   79.000000  100.500000
75%    121.750000  114.500000  102.750000
max    138.000000  143.000000  139.000000

In [ ]:
df2 = np.abs(df)>df.std()*3
df3 = df2.any(axis = 1)
df3

In [64]:
df[df3]

    语    数    外
A  48   54  139
E  97  143  103

In [67]:
per = np.random.permutation(6)
per

array([0, 5, 3, 2, 1, 4])

In [68]:
df.take(per)

     语    数    外
A   48   54  139
F   16  101   40
D  130  119   99
C  138   57  102
B   68   45   62
E   97  143  103

In [84]:
df = DataFrame({'item':['苹果','香蕉','橘子','香蕉','橘子', '苹果'],
                'price': [4,3,3,2.5,4,2],
                'color':['red','yellow','yellow','green','green','green']})
df

    color item  price
0     red   苹果    4.0
1  yellow   香蕉    3.0
2  yellow   橘子    3.0
3   green   香蕉    2.5
4   green   橘子    4.0
5   green   苹果    2.0

In [85]:
g = df.groupby('item')
g.groups

{'橘子': Int64Index([2, 4], dtype='int64'),
 '苹果': Int64Index([0, 5], dtype='int64'),
 '香蕉': Int64Index([1, 3], dtype='int64')}

In [86]:
m = g['price'].mean()
type(m)

pandas.core.series.Series

In [87]:
df_mean = DataFrame(m)
df_mean.columns = ['price_mean']

In [88]:
pd.merge(df, df_mean,left_on='item', right_index = True)

    color item  price  price_mean
0     red   苹果    4.0        3.00
5   green   苹果    2.0        3.00
1  yellow   香蕉    3.0        2.75
3   green   香蕉    2.5        2.75
2  yellow   橘子    3.0        3.50
4   green   橘子    4.0        3.50

In [89]:
df.groupby('color').sum()

        price
color
green     8.5
red       4.0
yellow    6.0

In [91]:
# 在进行分组时，如果多个条件进行分组，那么数据多层索引
df.groupby(['color','item']).sum()

             price
color  item
green  橘子      4.0
       苹果      2.0
       香蕉      2.5
red    苹果      4.0
yellow 橘子      3.0
       香蕉      3.0

In [94]:
df = DataFrame({'item': ['萝卜','白菜','辣椒','冬瓜','白菜','辣椒','冬瓜','白菜'],
                'color': ['red','white','green','green','white','red','green','white'],
                'weight': np.random.randint(50, 150, size = 8),
                'price': np.random.randint(1,4, size = 8)})
df

   color item  price  weight
0    red   萝卜      2     107
1  white   白菜      3     134
2  green   辣椒      1     146
3  green   冬瓜      1     148
4  white   白菜      3      56
5    red   辣椒      2      66
6  green   冬瓜      1     134
7  white   白菜      2      81

In [100]:
df.groupby('color')['price'].sum()['white']

color
green    3
red      4
white    8
Name: price, dtype: int32

In [103]:
df.groupby('item')[['weight','price']].apply(max)

      weight  price
item
冬瓜       148      1
白菜       134      3
萝卜       107      2
辣椒       146      2

In [104]:
df.groupby('item')[['weight','price']].transform(max)

   weight  price
0     107      2
1     134      3
2     146      2
3     148      1
4     134      3
5     146      2
6     148      1
7     134      3

In [110]:
def add_all(item):
    a = 0
    for i in item:
        a += i
    return a

In [111]:
df.groupby('item')['price'].apply(add_all)

item
冬瓜    2
白菜    8
萝卜    2
辣椒    3
Name: price, dtype: int64